Repository: Acidburn0zzz/store
Catalog: priv/gettext/*/LC_MESSAGES/errors.po
Languages: ar, ca, nb, uk

source: can't be blank
ar: لا يمكن أن يكون فارغاً
ca: no es pot deixar en blanc
nb: kan ikke stå tom
uk: не може бути порожнім

source: has already been taken
ar: مأخوذ من قبل
ca: ja s'ha usat
nb: har allerede blitt brukt
uk: вже взято

source: is invalid
ar: غير صالح
ca: no és vàlid
nb: er ugyldig
uk: недійсне

source: must be accepted
ar: يجب الموافقة عليه
ca: s'ha d'acceptar
nb: må godtas
uk: повинні бути прийняті

source: has invalid format
ar: يحتوي على صيغة غير صالحة
ca: té un format no vàlid
nb: har ugyldig format
uk: має недійсний формат

source: has an invalid entry
ar: يحتوي على مدخل غير صالح
ca: té una entrada no vàlida
nb: har en ugyldig oppføring
uk: має недійсний запис

source: is reserved
ar: محجوز
ca: està reservat
nb: er reservert
uk: зарезервовано

source: does not match confirmation
ar: لا يطابق التأكيد
ca: no coincideix amb la confirmació
nb: samsvarer ikke med bekreftelse
uk: не збігається з підтвердженням

source: is still associated with this entry
ar: ما زال مرتبطاً بهذا المدخل
ca: encara s'associa amb aquesta entrada
nb: er fremdeles tilknyttet denne oppføringen
uk: досі асоціюється з цим записом

source: are still associated with this entry
ar: ما زالت مرتبطة بهذا المدخل
ca: encara s'associen amb aquesta entrada
nb: er fremdeles tilknyttet denne oppføringen
uk: досі пов'язані з цим записом

source: should be %{count} character(s)
ar: ينبغي ألا يحتوي على أي حرف
ca: hauria de tenir %{count} caràcter/s
uk: має бути %{count} символ

source: should have %{count} item(s)
ar: ينبغي ألا يحتوي على أي عنصر
ca: hauria de tenir %{count} element/s
nb: skal være ett element
uk: повинно мати %{count} елемент

source: should be at least %{count} character(s)
ar: يمكن أن يحتوي على أي عدد من الأحرف
ca: hauria de tenir almenys %{count} caràcter/s
nb: skal være minst ett tegn
uk: має бути принаймні %{count} символ

source: should have at least %{count} item(s)
ar: يمكن أن يحتوي على أي عدد من العناصر
ca: hauria de tenir almenys %{count} element/s
nb: skall være minst ett element
uk: повинно мати принаймні %{count} елемент

source: should be at most %{count} character(s)
ar: ينبغي ألا يحتوي على أي حرف
ca: hauria de tenir com a màxim %{count} caràcter/s
nb: skal ikke være mer enn ett tegn
uk: має бути до %{count} символу

source: should have at most %{count} item(s)
ar: ينبغي ألا يحتوي على أي عنصر
ca: hauria de tenir com a màxim %{count} element/s
nb: skal ikke være mer enn ett element
uk: повинно мати до %{count} елемента

source: must be less than %{number}
ar: يجب أن يكون أقل من %{number}
ca: hauria de ser inferior a %{number}
nb: må være mindre enn %{number}
uk: повинно бути менше %{number}

source: must be greater than %{number}
ar: يجب أن يكون أكثر من %{number}
ca: hauria de ser superior a %{number}
nb: må være større enn %{number}
uk: повинно бути більше за %{number}

source: must be less than or equal to %{number}
ar: يجب أن يكون أقل من أو يساوي %{number}
ca: hauria de ser inferior o igual a %{number}
nb: må være mindre enn eller lik %{number}
uk: має бути менше або дорівнювати %{number}

source: must be greater than or equal to %{number}
ar: يجب أن يكون أكثر من أو يساوي %{number}
ca: hauria de ser superior o igual a %{number}
nb: må være større enn eller lik %{number}
uk: має бути більше або дорівнювати %{number}

source: must be equal to %{number}
ar: يجب أن يساوي %{number}
ca: hauria de ser igual a %{number}
nb: må være like %{number}
uk: має дорівнювати %{number}
